print("Шляпка гриба, покрытая … кожиц..й, держится на … ножк.. . Снизу шляпка затянута … плёнкой. Когда её уберёшь, откроется нижняя … сторона шляпк.. .")

slv1 = input("Введи с клавиатуры недостающее первое слово: покрытая ... кожцй: ")

ltr1 = input("Введи с клавиатуры недостающую первую букву: покрытая кожиц...й: ")

slv2 = input("Введи с клавиатуры недостающее второе слово:  держится на … ножк: ")

ltr2 = input("Введи с клавиатуры недостающую вторую букву: на ножк...: ")

slv3 = input("Введи с клавиатуры недостающее третье слово: ... пленкой: ")

slv4 = input("Введи с клавиатуры недостающее четвертое слово: ... сторона: ")

ltr3 = input("Введи с клавиатуры недостающее третью букву: сторона шляпк... : ")

print(f"Шляпка гриба, покрытая {slv1} кожиц{ltr1}й, держится на {slv2} ножк{ltr2} . Снизу шляпка затянута {slv3} плёнкой. Когда её уберёшь, откроется нижняя {slv4} сторона шляпк{ltr3}.")